HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMtu_bf.h
/**
 * \file IfxMtu_bf.h
 * \brief
 * \copyright Copyright (c) 2018 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC37x_TS_V2.6.0.R0
 * Specification: TC3xx Target Specification.V2.6.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxSfr_Mtu_Registers_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxSfr_Mtu_Registers
 * 
 */
#ifndef IFXMTU_BF_H
#define IFXMTU_BF_H 1

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Mtu_Registers_BitfieldsMask
 * \{  */
/** \brief Length for Ifx_MTU_CLC_Bits.DISR */
#define IFX_MTU_CLC_DISR_LEN (1u)

/** \brief Mask for Ifx_MTU_CLC_Bits.DISR */
#define IFX_MTU_CLC_DISR_MSK (0x1u)

/** \brief Offset for Ifx_MTU_CLC_Bits.DISR */
#define IFX_MTU_CLC_DISR_OFF (0u)

/** \brief Length for Ifx_MTU_CLC_Bits.DISS */
#define IFX_MTU_CLC_DISS_LEN (1u)

/** \brief Mask for Ifx_MTU_CLC_Bits.DISS */
#define IFX_MTU_CLC_DISS_MSK (0x1u)

/** \brief Offset for Ifx_MTU_CLC_Bits.DISS */
#define IFX_MTU_CLC_DISS_OFF (1u)

/** \brief Length for Ifx_MTU_CLC_Bits.Resvd */
#define IFX_MTU_CLC_RESVD_LEN (1u)

/** \brief Mask for Ifx_MTU_CLC_Bits.Resvd */
#define IFX_MTU_CLC_RESVD_MSK (0x1u)

/** \brief Offset for Ifx_MTU_CLC_Bits.Resvd */
#define IFX_MTU_CLC_RESVD_OFF (2u)

/** \brief Length for Ifx_MTU_CLC_Bits.EDIS */
#define IFX_MTU_CLC_EDIS_LEN (1u)

/** \brief Mask for Ifx_MTU_CLC_Bits.EDIS */
#define IFX_MTU_CLC_EDIS_MSK (0x1u)

/** \brief Offset for Ifx_MTU_CLC_Bits.EDIS */
#define IFX_MTU_CLC_EDIS_OFF (3u)

/** \brief Length for Ifx_MTU_ID_Bits.MODREV */
#define IFX_MTU_ID_MODREV_LEN (8u)

/** \brief Mask for Ifx_MTU_ID_Bits.MODREV */
#define IFX_MTU_ID_MODREV_MSK (0xffu)

/** \brief Offset for Ifx_MTU_ID_Bits.MODREV */
#define IFX_MTU_ID_MODREV_OFF (0u)

/** \brief Length for Ifx_MTU_ID_Bits.MODTYPE */
#define IFX_MTU_ID_MODTYPE_LEN (8u)

/** \brief Mask for Ifx_MTU_ID_Bits.MODTYPE */
#define IFX_MTU_ID_MODTYPE_MSK (0xffu)

/** \brief Offset for Ifx_MTU_ID_Bits.MODTYPE */
#define IFX_MTU_ID_MODTYPE_OFF (8u)

/** \brief Length for Ifx_MTU_ID_Bits.MODNUMBER */
#define IFX_MTU_ID_MODNUMBER_LEN (16u)

/** \brief Mask for Ifx_MTU_ID_Bits.MODNUMBER */
#define IFX_MTU_ID_MODNUMBER_MSK (0xffffu)

/** \brief Offset for Ifx_MTU_ID_Bits.MODNUMBER */
#define IFX_MTU_ID_MODNUMBER_OFF (16u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU0_DMEM_EN */
#define IFX_MTU_MEMTEST0_CPU0_DMEM_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU0_DMEM_EN */
#define IFX_MTU_MEMTEST0_CPU0_DMEM_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU0_DMEM_EN */
#define IFX_MTU_MEMTEST0_CPU0_DMEM_EN_OFF (0u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU0_DTAG_EN */
#define IFX_MTU_MEMTEST0_CPU0_DTAG_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU0_DTAG_EN */
#define IFX_MTU_MEMTEST0_CPU0_DTAG_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU0_DTAG_EN */
#define IFX_MTU_MEMTEST0_CPU0_DTAG_EN_OFF (1u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU0_PMEM_EN */
#define IFX_MTU_MEMTEST0_CPU0_PMEM_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU0_PMEM_EN */
#define IFX_MTU_MEMTEST0_CPU0_PMEM_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU0_PMEM_EN */
#define IFX_MTU_MEMTEST0_CPU0_PMEM_EN_OFF (2u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU0_PTAG_EN */
#define IFX_MTU_MEMTEST0_CPU0_PTAG_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU0_PTAG_EN */
#define IFX_MTU_MEMTEST0_CPU0_PTAG_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU0_PTAG_EN */
#define IFX_MTU_MEMTEST0_CPU0_PTAG_EN_OFF (3u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU0_DLMU_STBY_EN */
#define IFX_MTU_MEMTEST0_CPU0_DLMU_STBY_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU0_DLMU_STBY_EN */
#define IFX_MTU_MEMTEST0_CPU0_DLMU_STBY_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU0_DLMU_STBY_EN */
#define IFX_MTU_MEMTEST0_CPU0_DLMU_STBY_EN_OFF (4u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU1_DMEM_EN */
#define IFX_MTU_MEMTEST0_CPU1_DMEM_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU1_DMEM_EN */
#define IFX_MTU_MEMTEST0_CPU1_DMEM_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU1_DMEM_EN */
#define IFX_MTU_MEMTEST0_CPU1_DMEM_EN_OFF (5u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU1_DTAG_EN */
#define IFX_MTU_MEMTEST0_CPU1_DTAG_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU1_DTAG_EN */
#define IFX_MTU_MEMTEST0_CPU1_DTAG_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU1_DTAG_EN */
#define IFX_MTU_MEMTEST0_CPU1_DTAG_EN_OFF (6u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU1_PMEM_EN */
#define IFX_MTU_MEMTEST0_CPU1_PMEM_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU1_PMEM_EN */
#define IFX_MTU_MEMTEST0_CPU1_PMEM_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU1_PMEM_EN */
#define IFX_MTU_MEMTEST0_CPU1_PMEM_EN_OFF (7u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU1_PTAG_EN */
#define IFX_MTU_MEMTEST0_CPU1_PTAG_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU1_PTAG_EN */
#define IFX_MTU_MEMTEST0_CPU1_PTAG_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST0_Bits.CPU1_PTAG_EN */
#define IFX_MTU_MEMTEST0_CPU1_PTAG_EN_OFF (8u)

/** \brief Length for Ifx_MTU_MEMTEST0_Bits.CPU1_DLMU_STBY_EN */
#define IFX_MTU_MEMTEST0_CPU1_DLMU_STBY_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST0_Bits.CPU1_DLMU_STBY_EN */
#define IFX_MTU_MEMTEST0_CPU1_DLMU_STBY_EN_MSK (0x1u)

