HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMtu_bf.h
/** \brief Length for Ifx_MTU_MEMTEST1_Bits.GTM_DPLL2_EN */
#define IFX_MTU_MEMTEST1_GTM_DPLL2_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.GTM_DPLL2_EN */
#define IFX_MTU_MEMTEST1_GTM_DPLL2_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.GTM_DPLL2_EN */
#define IFX_MTU_MEMTEST1_GTM_DPLL2_EN_OFF (28u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.MCAN10_EN */
#define IFX_MTU_MEMTEST1_MCAN10_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.MCAN10_EN */
#define IFX_MTU_MEMTEST1_MCAN10_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.MCAN10_EN */
#define IFX_MTU_MEMTEST1_MCAN10_EN_OFF (30u)

/** \brief Length for Ifx_MTU_MEMTEST1_Bits.MCAN20_EN */
#define IFX_MTU_MEMTEST1_MCAN20_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST1_Bits.MCAN20_EN */
#define IFX_MTU_MEMTEST1_MCAN20_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST1_Bits.MCAN20_EN */
#define IFX_MTU_MEMTEST1_MCAN20_EN_OFF (31u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.MCAN21_EN */
#define IFX_MTU_MEMTEST2_MCAN21_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.MCAN21_EN */
#define IFX_MTU_MEMTEST2_MCAN21_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.MCAN21_EN */
#define IFX_MTU_MEMTEST2_MCAN21_EN_OFF (0u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.PSI5_EN */
#define IFX_MTU_MEMTEST2_PSI5_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.PSI5_EN */
#define IFX_MTU_MEMTEST2_PSI5_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.PSI5_EN */
#define IFX_MTU_MEMTEST2_PSI5_EN_OFF (1u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.ERAY_OBF0_EN */
#define IFX_MTU_MEMTEST2_ERAY_OBF0_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.ERAY_OBF0_EN */
#define IFX_MTU_MEMTEST2_ERAY_OBF0_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.ERAY_OBF0_EN */
#define IFX_MTU_MEMTEST2_ERAY_OBF0_EN_OFF (2u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.ERAY_TBF_IBF0_EN */
#define IFX_MTU_MEMTEST2_ERAY_TBF_IBF0_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.ERAY_TBF_IBF0_EN */
#define IFX_MTU_MEMTEST2_ERAY_TBF_IBF0_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.ERAY_TBF_IBF0_EN */
#define IFX_MTU_MEMTEST2_ERAY_TBF_IBF0_EN_OFF (4u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.ERAY_MBF0_EN */
#define IFX_MTU_MEMTEST2_ERAY_MBF0_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.ERAY_MBF0_EN */
#define IFX_MTU_MEMTEST2_ERAY_MBF0_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.ERAY_MBF0_EN */
#define IFX_MTU_MEMTEST2_ERAY_MBF0_EN_OFF (6u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.SCR_XRAM_EN */
#define IFX_MTU_MEMTEST2_SCR_XRAM_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.SCR_XRAM_EN */
#define IFX_MTU_MEMTEST2_SCR_XRAM_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.SCR_XRAM_EN */
#define IFX_MTU_MEMTEST2_SCR_XRAM_EN_OFF (13u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.SCR_RAMINT_EN */
#define IFX_MTU_MEMTEST2_SCR_RAMINT_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.SCR_RAMINT_EN */
#define IFX_MTU_MEMTEST2_SCR_RAMINT_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.SCR_RAMINT_EN */
#define IFX_MTU_MEMTEST2_SCR_RAMINT_EN_OFF (14u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.CIF_JPEG1_4_EN */
#define IFX_MTU_MEMTEST2_CIF_JPEG1_4_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.CIF_JPEG1_4_EN */
#define IFX_MTU_MEMTEST2_CIF_JPEG1_4_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.CIF_JPEG1_4_EN */
#define IFX_MTU_MEMTEST2_CIF_JPEG1_4_EN_OFF (15u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.CIF_JPEG3_EN */
#define IFX_MTU_MEMTEST2_CIF_JPEG3_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.CIF_JPEG3_EN */
#define IFX_MTU_MEMTEST2_CIF_JPEG3_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.CIF_JPEG3_EN */
#define IFX_MTU_MEMTEST2_CIF_JPEG3_EN_OFF (16u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.CIF_EN */
#define IFX_MTU_MEMTEST2_CIF_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.CIF_EN */
#define IFX_MTU_MEMTEST2_CIF_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.CIF_EN */
#define IFX_MTU_MEMTEST2_CIF_EN_OFF (17u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.GIGETH_RX_EN */
#define IFX_MTU_MEMTEST2_GIGETH_RX_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.GIGETH_RX_EN */
#define IFX_MTU_MEMTEST2_GIGETH_RX_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.GIGETH_RX_EN */
#define IFX_MTU_MEMTEST2_GIGETH_RX_EN_OFF (18u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.GIGETH_TX_EN */
#define IFX_MTU_MEMTEST2_GIGETH_TX_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.GIGETH_TX_EN */
#define IFX_MTU_MEMTEST2_GIGETH_TX_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.GIGETH_TX_EN */
#define IFX_MTU_MEMTEST2_GIGETH_TX_EN_OFF (19u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.SDMMC_EN */
#define IFX_MTU_MEMTEST2_SDMMC_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.SDMMC_EN */
#define IFX_MTU_MEMTEST2_SDMMC_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.SDMMC_EN */
#define IFX_MTU_MEMTEST2_SDMMC_EN_OFF (20u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.GIGETH_RX1_EN */
#define IFX_MTU_MEMTEST2_GIGETH_RX1_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.GIGETH_RX1_EN */
#define IFX_MTU_MEMTEST2_GIGETH_RX1_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.GIGETH_RX1_EN */
#define IFX_MTU_MEMTEST2_GIGETH_RX1_EN_OFF (22u)

/** \brief Length for Ifx_MTU_MEMTEST2_Bits.GIGETH_TX1_EN */
#define IFX_MTU_MEMTEST2_GIGETH_TX1_EN_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMTEST2_Bits.GIGETH_TX1_EN */
#define IFX_MTU_MEMTEST2_GIGETH_TX1_EN_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMTEST2_Bits.GIGETH_TX1_EN */
#define IFX_MTU_MEMTEST2_GIGETH_TX1_EN_OFF (23u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU0_DCMAP */
#define IFX_MTU_MEMMAP_CPU0_DCMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU0_DCMAP */
#define IFX_MTU_MEMMAP_CPU0_DCMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU0_DCMAP */
#define IFX_MTU_MEMMAP_CPU0_DCMAP_OFF (0u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU0_DTMAP */
#define IFX_MTU_MEMMAP_CPU0_DTMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU0_DTMAP */
#define IFX_MTU_MEMMAP_CPU0_DTMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU0_DTMAP */
#define IFX_MTU_MEMMAP_CPU0_DTMAP_OFF (1u)

