HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMtu_bf.h
/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU0_PCMAP */
#define IFX_MTU_MEMMAP_CPU0_PCMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU0_PCMAP */
#define IFX_MTU_MEMMAP_CPU0_PCMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU0_PCMAP */
#define IFX_MTU_MEMMAP_CPU0_PCMAP_OFF (2u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU0_PTMAP */
#define IFX_MTU_MEMMAP_CPU0_PTMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU0_PTMAP */
#define IFX_MTU_MEMMAP_CPU0_PTMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU0_PTMAP */
#define IFX_MTU_MEMMAP_CPU0_PTMAP_OFF (3u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU1_DCMAP */
#define IFX_MTU_MEMMAP_CPU1_DCMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU1_DCMAP */
#define IFX_MTU_MEMMAP_CPU1_DCMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU1_DCMAP */
#define IFX_MTU_MEMMAP_CPU1_DCMAP_OFF (5u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU1_DTMAP */
#define IFX_MTU_MEMMAP_CPU1_DTMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU1_DTMAP */
#define IFX_MTU_MEMMAP_CPU1_DTMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU1_DTMAP */
#define IFX_MTU_MEMMAP_CPU1_DTMAP_OFF (6u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU1_PCMAP */
#define IFX_MTU_MEMMAP_CPU1_PCMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU1_PCMAP */
#define IFX_MTU_MEMMAP_CPU1_PCMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU1_PCMAP */
#define IFX_MTU_MEMMAP_CPU1_PCMAP_OFF (7u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU1_PTMAP */
#define IFX_MTU_MEMMAP_CPU1_PTMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU1_PTMAP */
#define IFX_MTU_MEMMAP_CPU1_PTMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU1_PTMAP */
#define IFX_MTU_MEMMAP_CPU1_PTMAP_OFF (8u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU2_DCMAP */
#define IFX_MTU_MEMMAP_CPU2_DCMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU2_DCMAP */
#define IFX_MTU_MEMMAP_CPU2_DCMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU2_DCMAP */
#define IFX_MTU_MEMMAP_CPU2_DCMAP_OFF (10u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU2_DTMAP */
#define IFX_MTU_MEMMAP_CPU2_DTMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU2_DTMAP */
#define IFX_MTU_MEMMAP_CPU2_DTMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU2_DTMAP */
#define IFX_MTU_MEMMAP_CPU2_DTMAP_OFF (11u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU2_PCMAP */
#define IFX_MTU_MEMMAP_CPU2_PCMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU2_PCMAP */
#define IFX_MTU_MEMMAP_CPU2_PCMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU2_PCMAP */
#define IFX_MTU_MEMMAP_CPU2_PCMAP_OFF (12u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.CPU2_PTMAP */
#define IFX_MTU_MEMMAP_CPU2_PTMAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.CPU2_PTMAP */
#define IFX_MTU_MEMMAP_CPU2_PTMAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.CPU2_PTMAP */
#define IFX_MTU_MEMMAP_CPU2_PTMAP_OFF (13u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.MEM15MAP */
#define IFX_MTU_MEMMAP_MEM15MAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.MEM15MAP */
#define IFX_MTU_MEMMAP_MEM15MAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.MEM15MAP */
#define IFX_MTU_MEMMAP_MEM15MAP_OFF (15u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.MEM16MAP */
#define IFX_MTU_MEMMAP_MEM16MAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.MEM16MAP */
#define IFX_MTU_MEMMAP_MEM16MAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.MEM16MAP */
#define IFX_MTU_MEMMAP_MEM16MAP_OFF (16u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.MEM17MAP */
#define IFX_MTU_MEMMAP_MEM17MAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.MEM17MAP */
#define IFX_MTU_MEMMAP_MEM17MAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.MEM17MAP */
#define IFX_MTU_MEMMAP_MEM17MAP_OFF (17u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.MEM18MAP */
#define IFX_MTU_MEMMAP_MEM18MAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.MEM18MAP */
#define IFX_MTU_MEMMAP_MEM18MAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.MEM18MAP */
#define IFX_MTU_MEMMAP_MEM18MAP_OFF (18u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.MEM20MAP */
#define IFX_MTU_MEMMAP_MEM20MAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.MEM20MAP */
#define IFX_MTU_MEMMAP_MEM20MAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.MEM20MAP */
#define IFX_MTU_MEMMAP_MEM20MAP_OFF (20u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.MEM21MAP */
#define IFX_MTU_MEMMAP_MEM21MAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.MEM21MAP */
#define IFX_MTU_MEMMAP_MEM21MAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.MEM21MAP */
#define IFX_MTU_MEMMAP_MEM21MAP_OFF (21u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.MEM22MAP */
#define IFX_MTU_MEMMAP_MEM22MAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.MEM22MAP */
#define IFX_MTU_MEMMAP_MEM22MAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.MEM22MAP */
#define IFX_MTU_MEMMAP_MEM22MAP_OFF (22u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.MEM23MAP */
#define IFX_MTU_MEMMAP_MEM23MAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.MEM23MAP */
#define IFX_MTU_MEMMAP_MEM23MAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.MEM23MAP */
#define IFX_MTU_MEMMAP_MEM23MAP_OFF (23u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.MEM25MAP */
#define IFX_MTU_MEMMAP_MEM25MAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.MEM25MAP */
#define IFX_MTU_MEMMAP_MEM25MAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.MEM25MAP */
#define IFX_MTU_MEMMAP_MEM25MAP_OFF (25u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.MEM26MAP */
#define IFX_MTU_MEMMAP_MEM26MAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.MEM26MAP */
#define IFX_MTU_MEMMAP_MEM26MAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.MEM26MAP */
#define IFX_MTU_MEMMAP_MEM26MAP_OFF (26u)

/** \brief Length for Ifx_MTU_MEMMAP_Bits.MEM27MAP */
#define IFX_MTU_MEMMAP_MEM27MAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.MEM27MAP */
#define IFX_MTU_MEMMAP_MEM27MAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.MEM27MAP */
#define IFX_MTU_MEMMAP_MEM27MAP_OFF (27u)

