HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMtu_bf.h
/** \brief Length for Ifx_MTU_MEMMAP_Bits.MEM28MAP */
#define IFX_MTU_MEMMAP_MEM28MAP_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMMAP_Bits.MEM28MAP */
#define IFX_MTU_MEMMAP_MEM28MAP_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMMAP_Bits.MEM28MAP */
#define IFX_MTU_MEMMAP_MEM28MAP_OFF (28u)

/** \brief Length for Ifx_MTU_MEMSTAT0_Bits.CPU0_DMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU0_DMEM_AIU_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMSTAT0_Bits.CPU0_DMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU0_DMEM_AIU_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMSTAT0_Bits.CPU0_DMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU0_DMEM_AIU_OFF (0u)

/** \brief Length for Ifx_MTU_MEMSTAT0_Bits.CPU0_DTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU0_DTAG_AIU_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMSTAT0_Bits.CPU0_DTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU0_DTAG_AIU_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMSTAT0_Bits.CPU0_DTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU0_DTAG_AIU_OFF (1u)

/** \brief Length for Ifx_MTU_MEMSTAT0_Bits.CPU0_PMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU0_PMEM_AIU_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMSTAT0_Bits.CPU0_PMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU0_PMEM_AIU_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMSTAT0_Bits.CPU0_PMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU0_PMEM_AIU_OFF (2u)

/** \brief Length for Ifx_MTU_MEMSTAT0_Bits.CPU0_PTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU0_PTAG_AIU_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMSTAT0_Bits.CPU0_PTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU0_PTAG_AIU_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMSTAT0_Bits.CPU0_PTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU0_PTAG_AIU_OFF (3u)

/** \brief Length for Ifx_MTU_MEMSTAT0_Bits.CPU1_DMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU1_DMEM_AIU_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMSTAT0_Bits.CPU1_DMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU1_DMEM_AIU_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMSTAT0_Bits.CPU1_DMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU1_DMEM_AIU_OFF (5u)

/** \brief Length for Ifx_MTU_MEMSTAT0_Bits.CPU1_DTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU1_DTAG_AIU_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMSTAT0_Bits.CPU1_DTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU1_DTAG_AIU_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMSTAT0_Bits.CPU1_DTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU1_DTAG_AIU_OFF (6u)

/** \brief Length for Ifx_MTU_MEMSTAT0_Bits.CPU1_PMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU1_PMEM_AIU_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMSTAT0_Bits.CPU1_PMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU1_PMEM_AIU_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMSTAT0_Bits.CPU1_PMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU1_PMEM_AIU_OFF (7u)

/** \brief Length for Ifx_MTU_MEMSTAT0_Bits.CPU1_PTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU1_PTAG_AIU_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMSTAT0_Bits.CPU1_PTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU1_PTAG_AIU_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMSTAT0_Bits.CPU1_PTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU1_PTAG_AIU_OFF (8u)

/** \brief Length for Ifx_MTU_MEMSTAT0_Bits.CPU2_DMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU2_DMEM_AIU_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMSTAT0_Bits.CPU2_DMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU2_DMEM_AIU_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMSTAT0_Bits.CPU2_DMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU2_DMEM_AIU_OFF (10u)

/** \brief Length for Ifx_MTU_MEMSTAT0_Bits.CPU2_DTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU2_DTAG_AIU_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMSTAT0_Bits.CPU2_DTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU2_DTAG_AIU_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMSTAT0_Bits.CPU2_DTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU2_DTAG_AIU_OFF (11u)

/** \brief Length for Ifx_MTU_MEMSTAT0_Bits.CPU2_PMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU2_PMEM_AIU_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMSTAT0_Bits.CPU2_PMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU2_PMEM_AIU_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMSTAT0_Bits.CPU2_PMEM_AIU */
#define IFX_MTU_MEMSTAT0_CPU2_PMEM_AIU_OFF (12u)

/** \brief Length for Ifx_MTU_MEMSTAT0_Bits.CPU2_PTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU2_PTAG_AIU_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMSTAT0_Bits.CPU2_PTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU2_PTAG_AIU_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMSTAT0_Bits.CPU2_PTAG_AIU */
#define IFX_MTU_MEMSTAT0_CPU2_PTAG_AIU_OFF (13u)

/** \brief Length for Ifx_MTU_MEMSTAT1_Bits.CPU0_DMEM1_AIU */
#define IFX_MTU_MEMSTAT1_CPU0_DMEM1_AIU_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMSTAT1_Bits.CPU0_DMEM1_AIU */
#define IFX_MTU_MEMSTAT1_CPU0_DMEM1_AIU_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMSTAT1_Bits.CPU0_DMEM1_AIU */
#define IFX_MTU_MEMSTAT1_CPU0_DMEM1_AIU_OFF (2u)

/** \brief Length for Ifx_MTU_MEMSTAT1_Bits.CPU1_DMEM1_AIU */
#define IFX_MTU_MEMSTAT1_CPU1_DMEM1_AIU_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMSTAT1_Bits.CPU1_DMEM1_AIU */
#define IFX_MTU_MEMSTAT1_CPU1_DMEM1_AIU_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMSTAT1_Bits.CPU1_DMEM1_AIU */
#define IFX_MTU_MEMSTAT1_CPU1_DMEM1_AIU_OFF (3u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU0_DMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU0_DMEM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU0_DMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU0_DMEM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU0_DMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU0_DMEM_DONE_OFF (0u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU0_DTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU0_DTAG_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU0_DTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU0_DTAG_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU0_DTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU0_DTAG_DONE_OFF (1u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU0_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU0_PMEM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU0_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU0_PMEM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU0_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU0_PMEM_DONE_OFF (2u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU0_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU0_PTAG_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU0_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU0_PTAG_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU0_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU0_PTAG_DONE_OFF (3u)

