HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMtu_bf.h
/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.GTM_FIFO_DONE */
#define IFX_MTU_MEMDONE1_GTM_FIFO_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.GTM_FIFO_DONE */
#define IFX_MTU_MEMDONE1_GTM_FIFO_DONE_OFF (21u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.GTM_MCS0FAST_DONE */
#define IFX_MTU_MEMDONE1_GTM_MCS0FAST_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.GTM_MCS0FAST_DONE */
#define IFX_MTU_MEMDONE1_GTM_MCS0FAST_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.GTM_MCS0FAST_DONE */
#define IFX_MTU_MEMDONE1_GTM_MCS0FAST_DONE_OFF (23u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.GTM_MCS1FAST_DONE */
#define IFX_MTU_MEMDONE1_GTM_MCS1FAST_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.GTM_MCS1FAST_DONE */
#define IFX_MTU_MEMDONE1_GTM_MCS1FAST_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.GTM_MCS1FAST_DONE */
#define IFX_MTU_MEMDONE1_GTM_MCS1FAST_DONE_OFF (25u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.GTM_DPLL1A_DONE */
#define IFX_MTU_MEMDONE1_GTM_DPLL1A_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.GTM_DPLL1A_DONE */
#define IFX_MTU_MEMDONE1_GTM_DPLL1A_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.GTM_DPLL1A_DONE */
#define IFX_MTU_MEMDONE1_GTM_DPLL1A_DONE_OFF (26u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.GTM_DPLL1BC_DONE */
#define IFX_MTU_MEMDONE1_GTM_DPLL1BC_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.GTM_DPLL1BC_DONE */
#define IFX_MTU_MEMDONE1_GTM_DPLL1BC_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.GTM_DPLL1BC_DONE */
#define IFX_MTU_MEMDONE1_GTM_DPLL1BC_DONE_OFF (27u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.GTM_DPLL2_DONE */
#define IFX_MTU_MEMDONE1_GTM_DPLL2_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.GTM_DPLL2_DONE */
#define IFX_MTU_MEMDONE1_GTM_DPLL2_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.GTM_DPLL2_DONE */
#define IFX_MTU_MEMDONE1_GTM_DPLL2_DONE_OFF (28u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.MCAN10_DONE */
#define IFX_MTU_MEMDONE1_MCAN10_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.MCAN10_DONE */
#define IFX_MTU_MEMDONE1_MCAN10_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.MCAN10_DONE */
#define IFX_MTU_MEMDONE1_MCAN10_DONE_OFF (30u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.MCAN20_DONE */
#define IFX_MTU_MEMDONE1_MCAN20_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.MCAN20_DONE */
#define IFX_MTU_MEMDONE1_MCAN20_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.MCAN20_DONE */
#define IFX_MTU_MEMDONE1_MCAN20_DONE_OFF (31u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.MCAN21_DONE */
#define IFX_MTU_MEMDONE2_MCAN21_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.MCAN21_DONE */
#define IFX_MTU_MEMDONE2_MCAN21_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.MCAN21_DONE */
#define IFX_MTU_MEMDONE2_MCAN21_DONE_OFF (0u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.PSI5_DONE */
#define IFX_MTU_MEMDONE2_PSI5_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.PSI5_DONE */
#define IFX_MTU_MEMDONE2_PSI5_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.PSI5_DONE */
#define IFX_MTU_MEMDONE2_PSI5_DONE_OFF (1u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.ERAY_OBF0_DONE */
#define IFX_MTU_MEMDONE2_ERAY_OBF0_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.ERAY_OBF0_DONE */
#define IFX_MTU_MEMDONE2_ERAY_OBF0_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.ERAY_OBF0_DONE */
#define IFX_MTU_MEMDONE2_ERAY_OBF0_DONE_OFF (2u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.ERAY_TBF_IBF0_DONE */
#define IFX_MTU_MEMDONE2_ERAY_TBF_IBF0_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.ERAY_TBF_IBF0_DONE */
#define IFX_MTU_MEMDONE2_ERAY_TBF_IBF0_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.ERAY_TBF_IBF0_DONE */
#define IFX_MTU_MEMDONE2_ERAY_TBF_IBF0_DONE_OFF (4u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.ERAY_MBF0_DONE */
#define IFX_MTU_MEMDONE2_ERAY_MBF0_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.ERAY_MBF0_DONE */
#define IFX_MTU_MEMDONE2_ERAY_MBF0_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.ERAY_MBF0_DONE */
#define IFX_MTU_MEMDONE2_ERAY_MBF0_DONE_OFF (6u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.SCR_XRAM_DONE */
#define IFX_MTU_MEMDONE2_SCR_XRAM_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.SCR_XRAM_DONE */
#define IFX_MTU_MEMDONE2_SCR_XRAM_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.SCR_XRAM_DONE */
#define IFX_MTU_MEMDONE2_SCR_XRAM_DONE_OFF (13u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.SCR_RAMINT_DONE */
#define IFX_MTU_MEMDONE2_SCR_RAMINT_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.SCR_RAMINT_DONE */
#define IFX_MTU_MEMDONE2_SCR_RAMINT_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.SCR_RAMINT_DONE */
#define IFX_MTU_MEMDONE2_SCR_RAMINT_DONE_OFF (14u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.CIF_JPEG1_4_DONE */
#define IFX_MTU_MEMDONE2_CIF_JPEG1_4_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.CIF_JPEG1_4_DONE */
#define IFX_MTU_MEMDONE2_CIF_JPEG1_4_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.CIF_JPEG1_4_DONE */
#define IFX_MTU_MEMDONE2_CIF_JPEG1_4_DONE_OFF (15u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.CIF_JPEG3_DONE */
#define IFX_MTU_MEMDONE2_CIF_JPEG3_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.CIF_JPEG3_DONE */
#define IFX_MTU_MEMDONE2_CIF_JPEG3_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.CIF_JPEG3_DONE */
#define IFX_MTU_MEMDONE2_CIF_JPEG3_DONE_OFF (16u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.CIF_DONE */
#define IFX_MTU_MEMDONE2_CIF_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.CIF_DONE */
#define IFX_MTU_MEMDONE2_CIF_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.CIF_DONE */
#define IFX_MTU_MEMDONE2_CIF_DONE_OFF (17u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.GIGETH_RX_DONE */
#define IFX_MTU_MEMDONE2_GIGETH_RX_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.GIGETH_RX_DONE */
#define IFX_MTU_MEMDONE2_GIGETH_RX_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.GIGETH_RX_DONE */
#define IFX_MTU_MEMDONE2_GIGETH_RX_DONE_OFF (18u)

