HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMtu_bf.h
/** \brief Offset for Ifx_MTU_MEMFDA2_Bits.ERAY_TBF_IBF0_FDA */
#define IFX_MTU_MEMFDA2_ERAY_TBF_IBF0_FDA_OFF (4u)

/** \brief Length for Ifx_MTU_MEMFDA2_Bits.ERAY_MBF0_FDA */
#define IFX_MTU_MEMFDA2_ERAY_MBF0_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA2_Bits.ERAY_MBF0_FDA */
#define IFX_MTU_MEMFDA2_ERAY_MBF0_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA2_Bits.ERAY_MBF0_FDA */
#define IFX_MTU_MEMFDA2_ERAY_MBF0_FDA_OFF (6u)

/** \brief Length for Ifx_MTU_MEMFDA2_Bits.SCR_XRAM_FDA */
#define IFX_MTU_MEMFDA2_SCR_XRAM_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA2_Bits.SCR_XRAM_FDA */
#define IFX_MTU_MEMFDA2_SCR_XRAM_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA2_Bits.SCR_XRAM_FDA */
#define IFX_MTU_MEMFDA2_SCR_XRAM_FDA_OFF (13u)

/** \brief Length for Ifx_MTU_MEMFDA2_Bits.SCR_RAMINT_FDA */
#define IFX_MTU_MEMFDA2_SCR_RAMINT_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA2_Bits.SCR_RAMINT_FDA */
#define IFX_MTU_MEMFDA2_SCR_RAMINT_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA2_Bits.SCR_RAMINT_FDA */
#define IFX_MTU_MEMFDA2_SCR_RAMINT_FDA_OFF (14u)

/** \brief Length for Ifx_MTU_MEMFDA2_Bits.CIF_JPEG1_4_FDA */
#define IFX_MTU_MEMFDA2_CIF_JPEG1_4_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA2_Bits.CIF_JPEG1_4_FDA */
#define IFX_MTU_MEMFDA2_CIF_JPEG1_4_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA2_Bits.CIF_JPEG1_4_FDA */
#define IFX_MTU_MEMFDA2_CIF_JPEG1_4_FDA_OFF (15u)

/** \brief Length for Ifx_MTU_MEMFDA2_Bits.CIF_JPEG3_FDA */
#define IFX_MTU_MEMFDA2_CIF_JPEG3_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA2_Bits.CIF_JPEG3_FDA */
#define IFX_MTU_MEMFDA2_CIF_JPEG3_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA2_Bits.CIF_JPEG3_FDA */
#define IFX_MTU_MEMFDA2_CIF_JPEG3_FDA_OFF (16u)

/** \brief Length for Ifx_MTU_MEMFDA2_Bits.CIF_FDA */
#define IFX_MTU_MEMFDA2_CIF_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA2_Bits.CIF_FDA */
#define IFX_MTU_MEMFDA2_CIF_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA2_Bits.CIF_FDA */
#define IFX_MTU_MEMFDA2_CIF_FDA_OFF (17u)

/** \brief Length for Ifx_MTU_MEMFDA2_Bits.GIGETH_RX_FDA */
#define IFX_MTU_MEMFDA2_GIGETH_RX_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA2_Bits.GIGETH_RX_FDA */
#define IFX_MTU_MEMFDA2_GIGETH_RX_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA2_Bits.GIGETH_RX_FDA */
#define IFX_MTU_MEMFDA2_GIGETH_RX_FDA_OFF (18u)

/** \brief Length for Ifx_MTU_MEMFDA2_Bits.GIGETH_TX_FDA */
#define IFX_MTU_MEMFDA2_GIGETH_TX_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA2_Bits.GIGETH_TX_FDA */
#define IFX_MTU_MEMFDA2_GIGETH_TX_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA2_Bits.GIGETH_TX_FDA */
#define IFX_MTU_MEMFDA2_GIGETH_TX_FDA_OFF (19u)

/** \brief Length for Ifx_MTU_MEMFDA2_Bits.SDMMC_FDA */
#define IFX_MTU_MEMFDA2_SDMMC_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA2_Bits.SDMMC_FDA */
#define IFX_MTU_MEMFDA2_SDMMC_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA2_Bits.SDMMC_FDA */
#define IFX_MTU_MEMFDA2_SDMMC_FDA_OFF (20u)

/** \brief Length for Ifx_MTU_MEMFDA2_Bits.GIGETH_RX1_FDA */
#define IFX_MTU_MEMFDA2_GIGETH_RX1_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA2_Bits.GIGETH_RX1_FDA */
#define IFX_MTU_MEMFDA2_GIGETH_RX1_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA2_Bits.GIGETH_RX1_FDA */
#define IFX_MTU_MEMFDA2_GIGETH_RX1_FDA_OFF (22u)

/** \brief Length for Ifx_MTU_MEMFDA2_Bits.GIGETH_TX1_FDA */
#define IFX_MTU_MEMFDA2_GIGETH_TX1_FDA_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMFDA2_Bits.GIGETH_TX1_FDA */
#define IFX_MTU_MEMFDA2_GIGETH_TX1_FDA_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMFDA2_Bits.GIGETH_TX1_FDA */
#define IFX_MTU_MEMFDA2_GIGETH_TX1_FDA_OFF (23u)

/** \brief Length for Ifx_MTU_ACCEN0_Bits.EN0 */
#define IFX_MTU_ACCEN0_EN0_LEN (1u)

/** \brief Mask for Ifx_MTU_ACCEN0_Bits.EN0 */
#define IFX_MTU_ACCEN0_EN0_MSK (0x1u)

/** \brief Offset for Ifx_MTU_ACCEN0_Bits.EN0 */
#define IFX_MTU_ACCEN0_EN0_OFF (0u)

/** \brief Length for Ifx_MTU_ACCEN0_Bits.EN1 */
#define IFX_MTU_ACCEN0_EN1_LEN (1u)

/** \brief Mask for Ifx_MTU_ACCEN0_Bits.EN1 */
#define IFX_MTU_ACCEN0_EN1_MSK (0x1u)

/** \brief Offset for Ifx_MTU_ACCEN0_Bits.EN1 */
#define IFX_MTU_ACCEN0_EN1_OFF (1u)

/** \brief Length for Ifx_MTU_ACCEN0_Bits.EN2 */
#define IFX_MTU_ACCEN0_EN2_LEN (1u)

/** \brief Mask for Ifx_MTU_ACCEN0_Bits.EN2 */
#define IFX_MTU_ACCEN0_EN2_MSK (0x1u)

/** \brief Offset for Ifx_MTU_ACCEN0_Bits.EN2 */
#define IFX_MTU_ACCEN0_EN2_OFF (2u)

/** \brief Length for Ifx_MTU_ACCEN0_Bits.EN3 */
#define IFX_MTU_ACCEN0_EN3_LEN (1u)

/** \brief Mask for Ifx_MTU_ACCEN0_Bits.EN3 */
#define IFX_MTU_ACCEN0_EN3_MSK (0x1u)

/** \brief Offset for Ifx_MTU_ACCEN0_Bits.EN3 */
#define IFX_MTU_ACCEN0_EN3_OFF (3u)

/** \brief Length for Ifx_MTU_ACCEN0_Bits.EN4 */
#define IFX_MTU_ACCEN0_EN4_LEN (1u)

/** \brief Mask for Ifx_MTU_ACCEN0_Bits.EN4 */
#define IFX_MTU_ACCEN0_EN4_MSK (0x1u)

/** \brief Offset for Ifx_MTU_ACCEN0_Bits.EN4 */
#define IFX_MTU_ACCEN0_EN4_OFF (4u)

/** \brief Length for Ifx_MTU_ACCEN0_Bits.EN5 */
#define IFX_MTU_ACCEN0_EN5_LEN (1u)

/** \brief Mask for Ifx_MTU_ACCEN0_Bits.EN5 */
#define IFX_MTU_ACCEN0_EN5_MSK (0x1u)

/** \brief Offset for Ifx_MTU_ACCEN0_Bits.EN5 */
#define IFX_MTU_ACCEN0_EN5_OFF (5u)

/** \brief Length for Ifx_MTU_ACCEN0_Bits.EN6 */
#define IFX_MTU_ACCEN0_EN6_LEN (1u)

/** \brief Mask for Ifx_MTU_ACCEN0_Bits.EN6 */
#define IFX_MTU_ACCEN0_EN6_MSK (0x1u)

/** \brief Offset for Ifx_MTU_ACCEN0_Bits.EN6 */
#define IFX_MTU_ACCEN0_EN6_OFF (6u)

/** \brief Length for Ifx_MTU_ACCEN0_Bits.EN7 */
#define IFX_MTU_ACCEN0_EN7_LEN (1u)

/** \brief Mask for Ifx_MTU_ACCEN0_Bits.EN7 */
#define IFX_MTU_ACCEN0_EN7_MSK (0x1u)

/** \brief Offset for Ifx_MTU_ACCEN0_Bits.EN7 */
#define IFX_MTU_ACCEN0_EN7_OFF (7u)

/** \brief Length for Ifx_MTU_ACCEN0_Bits.EN8 */
#define IFX_MTU_ACCEN0_EN8_LEN (1u)

/** \brief Mask for Ifx_MTU_ACCEN0_Bits.EN8 */
#define IFX_MTU_ACCEN0_EN8_MSK (0x1u)

/** \brief Offset for Ifx_MTU_ACCEN0_Bits.EN8 */
#define IFX_MTU_ACCEN0_EN8_OFF (8u)

/** \brief Length for Ifx_MTU_ACCEN0_Bits.EN9 */
#define IFX_MTU_ACCEN0_EN9_LEN (1u)

/** \brief Mask for Ifx_MTU_ACCEN0_Bits.EN9 */
#define IFX_MTU_ACCEN0_EN9_MSK (0x1u)

/** \brief Offset for Ifx_MTU_ACCEN0_Bits.EN9 */
#define IFX_MTU_ACCEN0_EN9_OFF (9u)

/** \brief Length for Ifx_MTU_ACCEN0_Bits.EN10 */
#define IFX_MTU_ACCEN0_EN10_LEN (1u)

