HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMtu_bf.h
/** \brief Mask for Ifx_MTU_MC_ECCS_Bits.UCENE */
#define IFX_MTU_MC_ECCS_UCENE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCS_Bits.UCENE */
#define IFX_MTU_MC_ECCS_UCENE_OFF (1u)

/** \brief Length for Ifx_MTU_MC_ECCS_Bits.MENE */
#define IFX_MTU_MC_ECCS_MENE_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCS_Bits.MENE */
#define IFX_MTU_MC_ECCS_MENE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCS_Bits.MENE */
#define IFX_MTU_MC_ECCS_MENE_OFF (2u)

/** \brief Length for Ifx_MTU_MC_ECCS_Bits.ECE */
#define IFX_MTU_MC_ECCS_ECE_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCS_Bits.ECE */
#define IFX_MTU_MC_ECCS_ECE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCS_Bits.ECE */
#define IFX_MTU_MC_ECCS_ECE_OFF (3u)

/** \brief Length for Ifx_MTU_MC_ECCS_Bits.TRE */
#define IFX_MTU_MC_ECCS_TRE_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCS_Bits.TRE */
#define IFX_MTU_MC_ECCS_TRE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCS_Bits.TRE */
#define IFX_MTU_MC_ECCS_TRE_OFF (4u)

/** \brief Length for Ifx_MTU_MC_ECCS_Bits.BFLE */
#define IFX_MTU_MC_ECCS_BFLE_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCS_Bits.BFLE */
#define IFX_MTU_MC_ECCS_BFLE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCS_Bits.BFLE */
#define IFX_MTU_MC_ECCS_BFLE_OFF (5u)

/** \brief Length for Ifx_MTU_MC_ECCS_Bits.SFLE */
#define IFX_MTU_MC_ECCS_SFLE_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCS_Bits.SFLE */
#define IFX_MTU_MC_ECCS_SFLE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCS_Bits.SFLE */
#define IFX_MTU_MC_ECCS_SFLE_OFF (6u)

/** \brief Length for Ifx_MTU_MC_ECCS_Bits.ECCMAP */
#define IFX_MTU_MC_ECCS_ECCMAP_LEN (2u)

/** \brief Mask for Ifx_MTU_MC_ECCS_Bits.ECCMAP */
#define IFX_MTU_MC_ECCS_ECCMAP_MSK (0x3u)

/** \brief Offset for Ifx_MTU_MC_ECCS_Bits.ECCMAP */
#define IFX_MTU_MC_ECCS_ECCMAP_OFF (8u)

/** \brief Length for Ifx_MTU_MC_ECCS_Bits.TC_TWR_SEL */
#define IFX_MTU_MC_ECCS_TC_TWR_SEL_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCS_Bits.TC_TWR_SEL */
#define IFX_MTU_MC_ECCS_TC_TWR_SEL_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCS_Bits.TC_TWR_SEL */
#define IFX_MTU_MC_ECCS_TC_TWR_SEL_OFF (10u)

/** \brief Length for Ifx_MTU_MC_ECCS_Bits.SFFD */
#define IFX_MTU_MC_ECCS_SFFD_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCS_Bits.SFFD */
#define IFX_MTU_MC_ECCS_SFFD_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCS_Bits.SFFD */
#define IFX_MTU_MC_ECCS_SFFD_OFF (11u)

/** \brief Length for Ifx_MTU_MC_ECCD_Bits.SERR */
#define IFX_MTU_MC_ECCD_SERR_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCD_Bits.SERR */
#define IFX_MTU_MC_ECCD_SERR_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCD_Bits.SERR */
#define IFX_MTU_MC_ECCD_SERR_OFF (0u)

/** \brief Length for Ifx_MTU_MC_ECCD_Bits.CERR */
#define IFX_MTU_MC_ECCD_CERR_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCD_Bits.CERR */
#define IFX_MTU_MC_ECCD_CERR_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCD_Bits.CERR */
#define IFX_MTU_MC_ECCD_CERR_OFF (1u)

/** \brief Length for Ifx_MTU_MC_ECCD_Bits.UCERR */
#define IFX_MTU_MC_ECCD_UCERR_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCD_Bits.UCERR */
#define IFX_MTU_MC_ECCD_UCERR_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCD_Bits.UCERR */
#define IFX_MTU_MC_ECCD_UCERR_OFF (2u)

/** \brief Length for Ifx_MTU_MC_ECCD_Bits.MERR */
#define IFX_MTU_MC_ECCD_MERR_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCD_Bits.MERR */
#define IFX_MTU_MC_ECCD_MERR_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCD_Bits.MERR */
#define IFX_MTU_MC_ECCD_MERR_OFF (3u)

/** \brief Length for Ifx_MTU_MC_ECCD_Bits.TRC */
#define IFX_MTU_MC_ECCD_TRC_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCD_Bits.TRC */
#define IFX_MTU_MC_ECCD_TRC_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCD_Bits.TRC */
#define IFX_MTU_MC_ECCD_TRC_OFF (4u)

/** \brief Length for Ifx_MTU_MC_ECCD_Bits.VAL */
#define IFX_MTU_MC_ECCD_VAL_LEN (5u)

/** \brief Mask for Ifx_MTU_MC_ECCD_Bits.VAL */
#define IFX_MTU_MC_ECCD_VAL_MSK (0x1fu)

/** \brief Offset for Ifx_MTU_MC_ECCD_Bits.VAL */
#define IFX_MTU_MC_ECCD_VAL_OFF (5u)

/** \brief Length for Ifx_MTU_MC_ECCD_Bits.PERMERR */
#define IFX_MTU_MC_ECCD_PERMERR_LEN (5u)

/** \brief Mask for Ifx_MTU_MC_ECCD_Bits.PERMERR */
#define IFX_MTU_MC_ECCD_PERMERR_MSK (0x1fu)

/** \brief Offset for Ifx_MTU_MC_ECCD_Bits.PERMERR */
#define IFX_MTU_MC_ECCD_PERMERR_OFF (10u)

/** \brief Length for Ifx_MTU_MC_ECCD_Bits.EOV */
#define IFX_MTU_MC_ECCD_EOV_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ECCD_Bits.EOV */
#define IFX_MTU_MC_ECCD_EOV_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ECCD_Bits.EOV */
#define IFX_MTU_MC_ECCD_EOV_OFF (15u)

/** \brief Length for Ifx_MTU_MC_ETRR_Bits.ADDR */
#define IFX_MTU_MC_ETRR_ADDR_LEN (13u)

/** \brief Mask for Ifx_MTU_MC_ETRR_Bits.ADDR */
#define IFX_MTU_MC_ETRR_ADDR_MSK (0x1fffu)

/** \brief Offset for Ifx_MTU_MC_ETRR_Bits.ADDR */
#define IFX_MTU_MC_ETRR_ADDR_OFF (0u)

/** \brief Length for Ifx_MTU_MC_ETRR_Bits.MBI */
#define IFX_MTU_MC_ETRR_MBI_LEN (3u)

/** \brief Mask for Ifx_MTU_MC_ETRR_Bits.MBI */
#define IFX_MTU_MC_ETRR_MBI_MSK (0x7u)

/** \brief Offset for Ifx_MTU_MC_ETRR_Bits.MBI */
#define IFX_MTU_MC_ETRR_MBI_OFF (13u)

/** \brief Length for Ifx_MTU_MC_RDBFL_Bits.WDATA */
#define IFX_MTU_MC_RDBFL_WDATA_LEN (16u)

/** \brief Mask for Ifx_MTU_MC_RDBFL_Bits.WDATA */
#define IFX_MTU_MC_RDBFL_WDATA_MSK (0xffffu)

/** \brief Offset for Ifx_MTU_MC_RDBFL_Bits.WDATA */
#define IFX_MTU_MC_RDBFL_WDATA_OFF (0u)

/** \brief Length for Ifx_MTU_MC_ALMSRCS_Bits.SBE */
#define IFX_MTU_MC_ALMSRCS_SBE_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ALMSRCS_Bits.SBE */
#define IFX_MTU_MC_ALMSRCS_SBE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ALMSRCS_Bits.SBE */
#define IFX_MTU_MC_ALMSRCS_SBE_OFF (0u)

/** \brief Length for Ifx_MTU_MC_ALMSRCS_Bits.DBE */
#define IFX_MTU_MC_ALMSRCS_DBE_LEN (1u)

/** \brief Mask for Ifx_MTU_MC_ALMSRCS_Bits.DBE */
#define IFX_MTU_MC_ALMSRCS_DBE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MC_ALMSRCS_Bits.DBE */
#define IFX_MTU_MC_ALMSRCS_DBE_OFF (1u)

/** \brief Length for Ifx_MTU_MC_ALMSRCS_Bits.ADDRE */
#define IFX_MTU_MC_ALMSRCS_ADDRE_LEN (1u)

